app/views/users/index.html.erb

SELECT COUNT(*) FROM "articles" WHERE "articles"."user_id" = ?  [["user_id", 2]]
---
      <td> <%= link_to user.username, user %> </td>
      <td> <%= pluralize(user.articles.count, 'article') %> </td>