app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles"
SELECT COUNT(*) FROM "articles"
---
    def index
        @articles = Article.paginate(page: params[:page], per_page: 2)

INSERT INTO "articles" ("title", "description", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "delete"], ["description", " deletedeletedeletedeletedeletedelete"], ["created_at", "2023-02-20 11:40:15.649154"], ["updated_at", "2023-02-20 11:40:15.649154"], ["user_id", 15]]
---
    def create
        # render plain: params[:article]
        @article = Article.new(article_params)
        @article.user = current_user
        # render plain: @article.inspect
        if @article.save