app/controllers/users_controller.rb

    def index
        @users = User.paginate(page: params[:page], per_page: 2)
---
SELECT "users".* FROM "users" LIMIT ? OFFSET ?  [["LIMIT", 2], ["OFFSET", 0]]
SELECT COUNT(*) FROM "users"

    def create
        # render plain: params[:article]
        @user = User.new(user_params)
        # render plain: @article.inspect
        if @user.save
---
INSERT INTO "users" ("username", "email", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?, ?)  [["username", "delete"], ["email", "delete@delete.com"], ["created_at", "2023-02-20 11:40:03.050384"], ["updated_at", "2023-02-20 11:40:03.050384"], ["password_digest", "[FILTERED]"]]

    def update
        if @user.update(user_params)
---
UPDATE "users" SET "updated_at" = ?, "password_digest" = ?, "avatar" = ? WHERE "users"."id" = ?  [["updated_at", "2023-02-21 10:11:41.063079"], ["password_digest", "[FILTERED]"], ["avatar", "image.png"], ["id", 24]]